# Entertainer Data Analysis and Preprocessing

### Cleaning and Merging Entertainer Datasets
 ### Preparing Data for Age and Breakthrough Analysis

## Import Libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

### Data Loading
 The code loads four Excel files containing information about entertainers using pandas.

In [2]:
df1 = pd.read_excel("Copy of Entertainer - Last work Info.xlsx")
df2 = pd.read_excel("Entertainer - Basic Info.xlsx")
df3 = pd.read_excel("Entertainer - Breakthrough Info.xlsx")
df4 = pd.read_excel("Entertainer - Last work Info.xlsx")

## Data Exploration
 It examines the structure and content of each dataframe using methods like .head() and .info().

In [3]:
df1.head()

       Entertainer Gender (traditional)  Birth Year
0            Adele                    F        1988
1   Angelina Jolie                    F        1975
2  Aretha Franklin                    F        1942
3      Bette Davis                    F        1908
4      Betty White                    F        1922

In [4]:
df2.head()

       Entertainer Gender (traditional)  Birth Year
0            Adele                    F        1988
1   Angelina Jolie                    F        1975
2  Aretha Franklin                    F        1942
3      Bette Davis                    F        1908
4      Betty White                    F        1922

In [5]:
df4.head()

       Entertainer Gender (traditional)  Birth Year
0            Adele                    F        1988
1   Angelina Jolie                    F        1975
2  Aretha Franklin                    F        1942
3      Bette Davis                    F        1908
4      Betty White                    F        1922

In [6]:
df3.head()

,Entertainer,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,2008,19,2009.0
1,Angelina Jolie,1999,"Girl, Interrupted",1999.0
2,Aretha Franklin,1967,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,1934,Of Human Bondage,1935.0
4,Betty White,1952,Life with Elilzabeth,1976.0

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entertainer           70 non-null     object
 1   Gender (traditional)  70 non-null     object
 2   Birth Year            70 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.8+ KB

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entertainer           70 non-null     object
 1   Gender (traditional)  70 non-null     object
 2   Birth Year            70 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.8+ KB

In [9]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 4 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 2   Breakthrough Name                             70 non-null     object
 3   Year of First Oscar/Grammy/Emmy               64 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.3+ KB

In [10]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entertainer           70 non-null     object
 1   Gender (traditional)  70 non-null     object
 2   Birth Year            70 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.8+ KB

## Data Consistency Check
The code verifies if df1, df2, and df4 are identical using the .equals() method.

In [11]:

print(df1.equals(df4))

True

In [12]:
print(df1.equals(df2))

True

## Handling Missing Data
It checks for null values in the dataframes

In [13]:
df3.isnull().sum()

Entertainer                                     0
Year of Breakthrough/#1 Hit/Award Nomination    0
Breakthrough Name                               0
Year of First Oscar/Grammy/Emmy                 6
dtype: int64

In [14]:
df3_cleaned = df3.dropna()

In [15]:
df3_cleaned.isnull().sum()

Entertainer                                     0
Year of Breakthrough/#1 Hit/Award Nomination    0
Breakthrough Name                               0
Year of First Oscar/Grammy/Emmy                 0
dtype: int64

## Data Merging
The code merges df1 with the cleaned df3 on the 'Entertainer' column to combine basic info with breakthrough data.

In [16]:
# Merge df1 with df3_cleaned on the 'Entertainer' column
merged_df = df1.merge(df3_cleaned, on='Entertainer', how='left')

In [17]:
merged_df

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,F,1988,2008.0,19,2009.0
1,Angelina Jolie,F,1975,1999.0,"Girl, Interrupted",1999.0
2,Aretha Franklin,F,1942,1967.0,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,F,1908,1934.0,Of Human Bondage,1935.0
4,Betty White,F,1922,1952.0,Life with Elilzabeth,1976.0
...,...,...,...,...,...,...
65,Tom Hanks,M,1956,1984.0,Splash,1993.0
66,Tony Bennett,M,1926,1951.0,Because of You,1963.0
67,Wayne Newton,M,1942,NaN,NaN,NaN
68,Will Smith,M,1968,1990.0,The Fresh Prince of Bel-Air,1988.0
69,Willie Nelson,M,1933,1975.0,Red Headed Stranger,1976.0

## Feature Engineering
 It creates new columns for 'Age' and 'Decade of Breakthrough' to enable further analysis.

In [18]:
merged_df['Age'] = 2024 - merged_df['Birth Year']
merged_df['Decade of Breakthrough'] = (merged_df['Year of Breakthrough/#1 Hit/Award Nomination'] // 10) * 10

## Data Export
Finally, the cleaned and processed data is exported to a CSV file for future use.

In [19]:
 #Export Cleaned Data
merged_df.to_csv('cleaned_data.csv', index=False)